#### Project 4: explore Stanford's school enrollment data

##### 1) create BQ dataset:

In [1]:
dataset_id = "school_enrollments"

In [2]:
!bq --location=US mk --dataset {dataset_id}

Dataset 'vocal-tracker-324800:school_enrollments' successfully created.

##### 2) create and populate BQ tables:

In [3]:
import os

In [4]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access/school-enrollments/*"
file_listings = os.popen(gsutil_cmd)

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset_id + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access/school-enrollments/zf406jp4427_ak.csv

Waiting on bqjob_r6157ca5e262e31b_0000017c1a1850fa_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access/school-enrollments/zf406jp4427_ar.csv

Waiting on bqjob_r73f0a0ad57eb961f_0000017c1a186260_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access/school-enrollments/zf406jp4427_ca.csv

Waiting on bqjob_r6a7cc82553e8c97f_0000017c1a187bb8_1 ... (14s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access/school-enrollments/zf406jp4427_ct.csv

Waiting on bqjob_r9cba02d653043a6_0000017c1a18bd99_1 ... (3s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access/school-enrollments/zf406jp4427_hi.csv

Waiting on bqjob_r61ec2f9840ba69af_0000017c1a18d2ab_1 ... (2s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access/school-enrollments/zf406jp4427_la.csv

Waiting on bqjob_r82610f5169bd73b_0000017c1a18e3dd_1 ... (4s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access/school-enrollments/zf406jp4427_md.csv

Waiting on bqjob_r2c5151a2e0933ee7_0000017c1a18fd6c_1 ... (1s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access/school-enrollments/zf406jp4427_mn.csv

Waiting on bqjob_r7d36b0d17e1db3c5_0000017c1a190a4a_1 ... (4s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access/school-enrollments/zf406jp4427_ms.csv

Waiting on bqjob_r7063883d355c03bc_0000017c1a1923bf_1 ... (2s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access/school-enrollments/zf406jp4427_nh.csv

Waiting on bqjob_r6f7cb91871d144f4_0000017c1a193495_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access/school-enrollments/zf406jp4427_nv.csv

Waiting on bqjob_r6648ef04720f4769_0000017c1a19459b_1 ... (2s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access/school-enrollments/zf406jp4427_ok.csv

Waiting on bqjob_r5deca10c1e08d8c7_0000017c1a1956a0_1 ... (3s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access/school-enrollments/zf406jp4427_pa.csv

Waiting on bqjob_r27042e10a01a2a40_0000017c1a196bfa_1 ... (3s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access/school-enrollments/zf406jp4427_sc.csv

Waiting on bqjob_rfbc01deaba0b10a_0000017c1a198114_1 ... (2s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access/school-enrollments/zf406jp4427_tx.csv

Waiting on bqjob_r601c842412f01ef0_0000017c1a1991c9_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access/school-enrollments/zf406jp4427_wa.csv

Waiting on bqjob_r19b51255b18f1f27_0000017c1a19aeb9_1 ... (4s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access/school-enrollments/zf406jp4427_wy.csv

Waiting on bqjob_r6be799db4d7a62df_0000017c1a19c7f6_1 ... (1s) Current status: DONE

#### 3) Find school enrollments by school name, grade level, and year for Texas

In [5]:
!bq show --schema=true {dataset_id}.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [8]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1198.72query/s]
Downloading: 100%|██████████| 1739/1739 [00:02<00:00, 703.31rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020    720
1     AKINS H S          grade_10  2021    747
2     AKINS H S          grade_11  2020    664
3     AKINS H S          grade_11  2021    663
4     AKINS H S          grade_12  2020    609
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021     69
1735  ZILKER EL      kindergarten  2020     77
1736  ZILKER EL      kindergarten  2021     63
1737  ZILKER EL  pre_kindergarten  2020     30
1738  ZILKER EL  pre_kindergarten  2021     13

[1739 rows x 4 columns]

##### Note: BQ string functions documentation: 
##### https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [9]:
!bq --location=US mk --dataset "views"

Dataset 'vocal-tracker-324800:views' successfully created.

In [11]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from `vocal-tracker-324800.school_enrollments.tx`
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1271.00query/s]

Empty DataFrame
Columns: []
Index: []

In [12]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2396.29query/s]
Downloading: 100%|██████████| 1739/1739 [00:00<00:00, 1803.92rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020    720
1     AKINS H S          grade_10  2021    747
2     AKINS H S          grade_11  2020    664
3     AKINS H S          grade_11  2021    663
4     AKINS H S          grade_12  2020    609
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021     69
1735  ZILKER EL      kindergarten  2020     77
1736  ZILKER EL      kindergarten  2021     63
1737  ZILKER EL  pre_kindergarten  2020     30
1738  ZILKER EL  pre_kindergarten  2021     13

[1739 rows x 4 columns]

#### 4) Open Data Studio and create chart from view:
##### https://datastudio.google.com/

#### Project 4 homework marker. Start homework from here.

Write 8 aggregate queries over the tables in the school_enrollment dataset that meet
these specs:
○ All queries should use a GROUP BY clause, one or more aggregate functions,
and an ORDER BY clause
○ At least 4 queries should use a HAVING clause
○ At least 4 queries should use a WHERE clause
○ At least 2 queries should use a UNION ALL or DISTINCT
○ Precede each query with a Markdown comment that describes its function.

Gathering a count of students by each grade for the state of Oklahoma in 2020.

In [94]:
%%bigquery
SELECT grade, sum(total) from school_enrollments.ok where year= 2020 and grade != 'k_12_total' 
GROUP BY grade ORDER BY COUNT(grade);

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1677.50query/s]
Downloading: 100%|██████████| 17/17 [00:00<00:00, 20.78rows/s]

                        grade     f0_
0       kindergarten_half_day     118
1   pre_kindergarten_half_day    8114
2       out_of_home_placement    2796
3                    grade_12   88296
4                    grade_11   95142
5                    grade_10  101308
6                     grade_9  102194
7                     grade_8  101794
8                     grade_7  105464
9                     grade_6  105794
10  pre_kindergarten_full_day   75642
11                    grade_5  105102
12                    grade_4  101808
13      kindergarten_full_day  105346
14                    grade_2  100996
15                    grade_1  105516
16                    grade_3  101870

Viewing the total amount of students in each district for Louisiana in 2021.

In [93]:
%%bigquery
SELECT district, sum(total) from school_enrollments.la 
where year = 2021 and  grade != 'pk_12_total' 
and admin_level = 'school' 
GROUP BY district ORDER BY district;

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1662.87query/s]
Downloading: 100%|██████████| 80/80 [00:00<00:00, 88.88rows/s]

                             district    f0_
0                       Acadia Parish  19052
1                        Allen Parish   8196
2                    Ascension Parish  46435
3                   Assumption Parish   6279
4                    Avoyelles Parish  10004
..                                ...    ...
75            West Baton Rouge Parish   8031
76                West Carroll Parish   3799
77              West Feliciana Parish   4296
78                        Winn Parish   3933
79  Zachary Community School District  10889

[80 rows x 2 columns]

Looking for the biggest enrollments of each grade in the school disctrict of Peavine, OKlahoma.

In [90]:
%%bigquery
SELECT grade, max(total) from school_enrollments.ok 
where district = 'PEAVINE' and admin_level = 'school' and grade != 'k_12_total' group by grade order by min(total);

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1668.16query/s]
Downloading: 100%|██████████| 10/10 [00:01<00:00,  6.59rows/s]

                       grade  f0_
0  pre_kindergarten_full_day   13
1                    grade_6   14
2                    grade_7   13
3      kindergarten_full_day    9
4                    grade_1   16
5                    grade_2   18
6                    grade_8   19
7                    grade_4   18
8                    grade_5   16
9                    grade_3   15

Gathering the average number of students enrolled at each school in for each country in Washington for the year 2021.

In [83]:
%%bigquery
SELECT county, AVG(total) from school_enrollments.wa
where year = 2021 and grade = 'pk_12_total' and admin_level = 'school'
GROUP BY county
ORDER BY COUNT(grade);

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1372.78query/s]
Downloading: 100%|██████████| 39/39 [00:00<00:00, 45.92rows/s]

          county         f0_
0       Garfield  181.000000
1      Wahkiakum  243.500000
2       Columbia   85.200000
3       Skamania  114.555556
4          Ferry  101.600000
5   Pend Oreille  148.300000
6         Asotin  263.500000
7      Jefferson  219.833333
8        Lincoln  141.600000
9       San Juan  121.800000
10         Adams  331.812500
11       Pacific  171.611111
12      Kittitas  280.888889
13       Douglas  392.157895
14        Island  385.904762
15     Klickitat  188.409091
16         Mason  408.960000
17       Whitman  169.370370
18       Clallam  358.103448
19   Walla Walla  287.966667
20      Okanogan  410.000000
21       Stevens  186.914286
22      Franklin  537.692308
23        Chelan  313.025000
24  Grays Harbor  250.333333
25         Lewis  281.023810
26       Cowlitz  351.574468
27        Skagit  344.388889
28         Grant  359.120690
29        Benton  562.939394
30       Whatcom  368.391892
31        Kitsap  452.666667
32      Thurston  487.209302
33        Yakima  491.853211
34         Clark  535.950000
35       Spokane  436.517241
36     Snohomish  532.838235
37        Pierce  507.450758
38          King  560.634100

Finding counties in California that have over 50,000 white students in 2021.

In [101]:
%%bigquery 
select county, sum(white) from school_enrollments.ca 
where grade = 'k_12_total' and admin_level = 'school' and year = 2021
group by county having sum(white) > 50000 
order by sum(white);

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1950.54query/s]
Downloading: 100%|██████████| 6/6 [00:00<00:00,  6.23rows/s]

           county       f0_
0  SAN BERNARDINO   63837.0
1      SACRAMENTO   68100.0
2       RIVERSIDE   79445.0
3          ORANGE  109356.0
4       SAN DIEGO  142509.0
5     LOS ANGELES  186630.0

finding districts with average female student populations over 100.

In [99]:
%%bigquery 

select district, AVG(female) from school_enrollments.wy group by district having avg(female) > 100 order by district;

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2067.52query/s]
Downloading: 100%|██████████| 10/10 [00:00<00:00, 11.09rows/s]

        district         f0_
0      Albany #1  125.266667
1    Campbell #1  236.583333
2    Fremont #25  106.047619
3     Laramie #1  268.392157
4     Lincoln #2  129.227273
5     Natrona #1  307.268293
6    Sheridan #2  148.652174
7  Sweetwater #1  174.767442
8       Teton #1  111.027778
9       Uinta #1  122.809524

Searching for school districts in Wyoming and Minnesota that have an average of over 200 male students.

In [133]:
%%bigquery 

select district, AVG(male) from school_enrollments.mn group by district having AVG(male) > 200
UNION ALL 
select district, AVG(male) from school_enrollments.wy group by district having AVG(male)> 200
order by district;

Query complete after 0.00s: 100%|██████████| 4/4 [00:00<00:00, 2605.97query/s]
Downloading: 100%|██████████| 32/32 [00:00<00:00, 33.41rows/s]

                                   district         f0_
0     Anoka-Hennepin Public School District  270.847953
1                               Campbell #1  246.666667
2       EDEN PRAIRIE PUBLIC SCHOOL DISTRICT  228.161404
3              EDINA PUBLIC SCHOOL DISTRICT  211.524138
4       Eden Prairie Public School District  255.814516
5              Edina Public School District  244.746988
6          Elk River Public School District  259.378882
7         Farmington Public School District  225.502146
8          Lakeville Public School District  224.872222
9                                Laramie #1  282.607843
10        MINNETONKA PUBLIC SCHOOL DISTRICT  267.025271
11        Minnetonka Public School District  333.659574
12          Moorhead Public School District  211.716667
13       Mounds View Public School District  226.497382
14                               Natrona #1  328.926829
15             Osseo Public School District  243.014400
16           Prior Lake-Savage Area Schools  236.172932
17             ROSEMOUNT-APPLE VALLEY-EAGAN  235.514586
18             Rosemount-Apple Valley-Eagan  304.436047
19          SHAKOPEE PUBLIC SCHOOL DISTRICT  213.528986
20      ST. MICHAEL-ALBERTVILLE SCHOOL DIST  230.291667
21      Sartell-St. Stephen School District  226.109375
22          Sauk Rapids-Rice Public Schools  203.531646
23          Shakopee Public School District  250.202532
24      South Washington County School Dist  224.763533
25  South Washington County School District  304.994819
26          Spring Lake Park Public Schools  205.755274
27      St. Michael-Albertville School Dist  258.461538
28  St. Michael-Albertville School District  296.835821
29   Stillwater Area Public School District  245.132075
30           WAYZATA PUBLIC SCHOOL DISTRICT  208.509091
31           Wayzata Public School District  253.329412

Getting a list of counties that have over 30 school districts.

In [165]:
%%bigquery
select county, count(distinct district_nces_id) 
from school_enrollments.tx
group by county
having count(distinct district_nces_id)> 30
order by county;

Query complete after 0.00s: 100%|██████████| 4/4 [00:00<00:00, 2202.02query/s]
Downloading: 100%|██████████| 3/3 [00:00<00:00,  3.59rows/s]

          county  f0_
0   BEXAR COUNTY   38
1  DALLAS COUNTY   46
2  HARRIS COUNTY   56

In [168]:
%%bigquery
create view views.counties_with_high_number_of_school_districts as
select county, count(distinct district_nces_id) as number_Of_Districts
from school_enrollments.tx
group by county
having count(distinct district_nces_id)> 30
order by county;

Executing query with job ID: 59183fd5-d37f-47d7-a9bc-b693c4aa1fa3
Query executing: 0.24s

ERROR:
 409 Already Exists: Table vocal-tracker-324800:views.counties_with_high_number_of_school_districts

(job ID: 59183fd5-d37f-47d7-a9bc-b693c4aa1fa3)

                      -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |
   1:create view views.counties_with_high_number_of_school_districts as
   2:select county, count(distinct district_nces_id) as number_Of_Districts
   3:from school_enrollments.tx
   4:group by county
   5:having count(distinct district_nces_id)> 30
   6:order by county;
    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |

In [172]:
%%bigquery
create view views.counties_with_high_population_of_white_students as
select county, sum(white) as total_white_population from school_enrollments.ca 
where grade = 'k_12_total' and admin_level = 'school' and year = 2021
group by county having sum(white) > 50000 
order by sum(white);

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1101.45query/s]

Empty DataFrame
Columns: []
Index: []

In [173]:
%%bigquery 
select * from views.counties_with_high_population_of_white_students;

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2001.10query/s]
Downloading: 100%|██████████| 6/6 [00:00<00:00,  6.49rows/s]

           county  total_white_population
0  SAN BERNARDINO                 63837.0
1      SACRAMENTO                 68100.0
2       RIVERSIDE                 79445.0
3          ORANGE                109356.0
4       SAN DIEGO                142509.0
5     LOS ANGELES                186630.0